"""
Задача
Шифр Цезаря полягає в заміні кожного символу вхідного рядка на символ,
що знаходиться на кілька позицій ліворуч або праворуч його в алфавіті.
Напишіть програму, яка шифрує текст шифром Цезаря.
Використовуваний алфавіт - пропуск і малі літери англійського алфавіту.
На першому рядку вказується зміщення шифрування: ціле число.
Додатне число відповідає зміщенню вправо. На другому рядку вказується
непорожній рядок-фраза для шифрування. Результатом роботи програми має
бути записана зашифрована послідовність.
Автор: Мотовилець Марія 31І
"""
n = int(input("Введіть значення зміщення (ціле число): "))
phrase = input("Введіть фразу для шифрування(букви англійського алфавіту та/або пропуски): ").lower().strip()

alphabet = ' abcdefghijklmnopqrstuvwxyz'

result = ''

for item in phrase:
    if n > 0:
        g = alphabet.index(item) + (n % 26)
    else:
        g = alphabet.index(item) - (abs(n) % 26)
    
    if g >= 27:
        result += alphabet[g - 26]
    elif g < 0:
        result += alphabet[g + 26]
    else:
        result += alphabet[g]

print("Зашифрована фраза:", result)
